colchonet/lib/tasks/migrar_senhas.rake

  task migrar_senhas: :environment do
    unless User.attribute_names.include? "password"
      puts "As senhas já foram migradas, terminando."
      return
    end
    User.find_each do |user|
      puts "Migrando usuário ##{user.id} #{user.full_name}"
      unencripted_password = user.attributes["password"]
      user.password = unencripted_password
      user.password_confirmation = unencripted_password
      user.save!
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1000]]
UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2021-09-05 11:03:27.932229"], ["password_digest", "$2a$12$6cTUqUtZEpXJqM8tLmubbezowGp.Dxgjy3p6VnmDnj4DBMzn.GMtG"], ["id", 1]]