colchonet/app/presenters/room_presenter.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."room_id" = ? AND "reviews"."user_id" = ? LIMIT ?  [["room_id", 1], ["user_id", 6], ["LIMIT", 1]]
---
  def review
    @review ||= @room.reviews.find_or_initialize_by(user_id: @context.current_user.id)