colchonet/app/controllers/confirmations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."confirmation_token" = ? LIMIT ?  [["confirmation_token", "z8U-VNvHk64GARk0bdjBOw"], ["LIMIT", 1]]
---
  def show
    user = User.find_by(confirmation_token: params[:token])