colchonet/app/controllers/home_controller.rb

SELECT "rooms".* FROM "rooms" LIMIT ?  [["LIMIT", 3]]
---
  def index
    @rooms = Room.take(3)