colchonet/app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" ORDER BY created_at DESC
---
  def index
    #@rooms = Room.all
    @rooms = Room.most_recent.limit(4)

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @room = Room.find(params[:id])

SELECT "rooms".* FROM "rooms" WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT ?  [["user_id", 6], ["id", 2], ["LIMIT", 1]]
---
  def edit
    @room = current_user.rooms.find(params[:id])

INSERT INTO "rooms" ("title", "location", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @room = current_user.rooms.build(room_params)

    if @room.save

SELECT "rooms".* FROM "rooms" WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT ?  [["user_id", 6], ["id", 2], ["LIMIT", 1]]
---
  def update
    @room = current_user.rooms.find(params[:id])

SELECT "rooms".* FROM "rooms" WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT ?  [["user_id", 6], ["id", 2], ["LIMIT", 1]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 2]]
---
  def destroy
    @room = current_user.rooms.find(params[:id])
    @room.destroy

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_room
      @room = Room.find(params[:id])