colchonet/app/controllers/users_controller.rb

INSERT INTO "users" ("full_name", "email", "location", "bio", "created_at", "updated_at", "password_digest", "confirmation_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["bio", "bla bla bla bla bla bla bla bla bla bla bla"], ["updated_at", "2021-09-03 23:30:22.392485"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)