colchonet/app/models/user_session.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def current_user
    User.find(@session[:user_id])